
def main():
    def f1():
        print('Список задач')

    def f2():
        print('Добавление задачи')
    
    def f3():
        print('Редактирование задачи')

    def f4():
        print('Завершение задачи')

    def f5():
        print('Возобновление задачи')

    def f6():
        print('Выход')

    d = {
        '1' : f1,
        '2' : f2,
        '3' : f3,
        '4' : f4,
        '5' : f5,
        '6' : f6,
    }
    s = '''
Ежедневник. Выберите действие:
        
1. Вывести список задач
2. Добавить задачу
3. Отредактировать задачу
4. Завершить задачу
5. Начать задачу сначала
6. Выход

'''
    while(1):
        i = input(s)
        if i in d:
            d[i]()
        else:
            print('Введен несуществующий пункт меню, повторите попытку')

        if i == '6':
            return

if __name__ == '__main__':
    main()






